[query_title]
Написать программу на Python для вычисления суммы списка чисел?

[query_title]
Написать программу на Python для вычисления суммы списка чисел?

[answer_title]
Ответ №1

[answer_content]
Для этого можно использовать функцию sum(), которая принимает список в качестве аргумента и возвращает сумму всех элементов:
```py
lst = [1, 2, 3, 4, 5]
summation = sum(lst)
print(summation)
```
В этом примере список [1, 2, 3, 4, 5] передается в функцию sum(), которая возвращает сумму всех его элементов - 15. Данное значение затем выводится на экран.

Можно также вычислить сумму элементов списка с помощью цикла for:
```py
lst = [1, 2, 3, 4, 5]
summation = 0
for i in lst:
    summation += i
print(summation)
```
В этом примере переменная summation инициализируется значением 0, а затем в цикле for проходится по всем элементам списка lst и их значения добавляются к переменной summation. Результат также выводится на экран.

Оба этих примера вычисляют сумму элементов списка и выводят результат на экран. Вы можете использовать любой из них в зависимости от того, что больше нравится.
