[query_title]
Написать программу на Python для подсчета количества строк в текстовом файле?

[query_title]
Написать программу на Python для подсчета количества строк в текстовом файле?

[answer_title]
Ответ №1

[answer_content]
Пример программы:
```py
with open('filename.txt', 'r') as file:
    line_count = 0
    for line in file:
        if line.strip():
            line_count += 1
print(f'Количество строк в файле: {line_count}')
```
Программа открывает файл 'filename.txt' и читает его построчно. Так как пустые строки тоже считаются строками, программа проверяет, не является ли строка пустой, с помощью метода strip(). Если строка не пустая, программа увеличивает счетчик строк на 1. В конце программа выводит количество строк в файле.
